export default[{
  title:'[개발일지] 블로그만들기 프로젝트 진행하며 ep.1',
  subtitle:'블로그 만드는게 쉬운게 아니었다..😂',
  content: `
  이제 개발공부를 시작한지 어느덧 8개월정도인데 문법만 배우면될 줄 알았던 그시절을지나
  router설정,데이터를 어떻게 담을지, 폴더는 어떻게 나눌지에대한 고민을 더 하게되는 시간이었다.
  블로그는 아직 완성되지못하고 앞으로 어떻게 완성해야될지도 모르지만 우선 무작정만들고있다.
  
  첫개발한 코드를 보면 html과 css정도로만 만든 페이지였는데 이제 조금 도전에대한 욕심이 생겼던것 같다.
  그래서 뭐든만들면 도움이 된다는 소리를 들었고, 혼자 진행하는 프로젝트를 블로그로 하기로했다.
  첫시도여서 많이 헤맬것같지만 한번 시작한거 꾸준히 만들어서 23년 8월달안에는 디자인과 이런것들을 배워 
  더 가꿔 나갈려고 생각중인데 쉽지많은 않은거같다.. 웹으로 입사해 활동하고있는 현역분들을 보면 대단함을 느낀다..

  완성해보자!!😊 
  `,
  date:'2023.05.23',
  link:'devdetail/0',
  number:1,
},]

