export default[
/* {
  title:'',
  subtitle:'',
  content:'',
  date:'',
  link:'nodedetail/0',
}, */
{
  title:'Node.js란?',
  subtitle:'Node.js의 Non-blocking장점과 설치방법',
  content:`
  >Node.js 왜 쓰는가?
  
  Node.js를 왜 쓰는지 부터 알아야하는데 그 중하나가 Non-blocking이다.<br>
  Non-blocking은 Node.js의 특징인데 밑에 예시를 통해 이해해볼수있다.<br>
  만약 티켓예매가 있다고하면, 일반서버의 경우 하나씩 데이터를 처리할것이다.<br>
  하지만 Node.js의 장점인 Non-blocking은 빨리데이터를 처리할 수 있는 것 부터 처리한다.<br><hr>
  만약 밑에와 같이 티켓예매 요청이 들어온다고 가정해보자<br>
  요청1) 티켓 2매<br>
  요청2) 티켓 1매<br>
  요청3) 티켓 100매<br>
  요청4) 티켓 5매<br><hr>

  만약 이렇게 요청이 있다면 일반서버의 경우 요청1 -> 요청2 -> 요청3 -> 요청4 순으로 처리하게될것이다.
  그런데 요청 3이 100매나 예약했기 때문에 요청4까지 오는데 매우 느릴 것이다. <br>
  이때 Node.js는 빨리 처리 할 수 있는 것부터 데이터처리를 하기때문에 <br>
  요청2 -> 요청1 -> 요청4 -> 요청3 순으로 데이터를 처리하게돼서, 한번에 많은 데이터를 처리해줄 수 있게된다.<br>
  이런 장점때문에 Node.js를 사용하는 것이다.

  >그럼 Node.js는 어떤 프로젝트를 하는데 적합한가?
  
  SNS, 채팅서비스, 프로토타입 만들기등 간단한 프로그램에 많이 사용한다<br>

  Node.js는 수학연산이나 어려운이미지 처리등 처리가 어려운 작업을 하기엔 적합하지않고 처리가 간단한 채팅,SNS 서비스에 많이사용한다.
  쉽고 빠르게 서버를 구축할 수 있다는 장점때문에 프로토타입을 만드는데 Node.js를 많이 사용하고있다.

  하지만 Node.js는 처리속도가 떨어질 수 있고, 수학연산이나 이미지처리 같은 라이브러리가 부족할 수 있다. 
  `,
  date:'23.06.28',
  link:'nodedetail/1',
},
]